## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.virtual_machines["cs2"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "cs2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + user_data                                              = "IyEgL3Vzci9iaW4vZW52IGJhc2gKCnNldCAtZXVvIHBpcGVmYWlsCgplY2hvICJbSU5GT10gSW5zdGFsbGluZyBkb2NrZXIiCnN1ZG8gYXB0IHVwZGF0ZQpzdWRvIGFwdCBpbnN0YWxsIC15IGRvY2tlciBkb2NrZXIuaW8gZG9ja2VyLWNvbXBvc2UKCmVjaG8gIkhPU1RfTkFNRT17bmFtZX0iID4gLmVudgp3Z2V0IGh0dHBzOi8vcmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbS9SdXV0UnkvY3MyLXNlcnZlcnMvbWFpbi9pbmZyYS9jb25maWcvZG9ja2VyLWNvbXBvc2UueWFtbAplY2hvICJbSU5GT10gU3RhcnRpbmcgZG9ja2VyLWNvbXBvc2UiCnN1ZG8gZG9ja2VyLWNvbXBvc2UgdXAgLWQK"
      + virtual_machine_id                                     = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["cs2"].azurerm_network_interface.game must be replaced
-/+ resource "azurerm_network_interface" "game" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkInterfaces/game-nic" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "vaa3itqj1areximjnjbrtdr1hb.gvxx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "60-45-BD-AC-D5-0A" -> (known after apply)
      ~ name                          = "game-nic" -> "cs2-game-nic" # forces replacement
      ~ private_ip_address            = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.2.4",
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ virtual_machine_id            = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Compute/virtualMachines/cs3" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "internal"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.2.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.virtual_machines["cs3"].azurerm_linux_virtual_machine.game will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "game" {
        id                                                     = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Compute/virtualMachines/cs3"
        name                                                   = "cs3"
      ~ network_interface_ids                                  = [
          - "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkInterfaces/game-nic",
        ] -> (known after apply)
        tags                                                   = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.virtual_machines["cs3"].azurerm_network_interface.game must be replaced
-/+ resource "azurerm_network_interface" "game" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkInterfaces/game-nic" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "vaa3itqj1areximjnjbrtdr1hb.gvxx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "60-45-BD-AC-D5-0A" -> (known after apply)
      ~ name                          = "game-nic" -> "cs3-game-nic" # forces replacement
      ~ private_ip_address            = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.2.4",
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ virtual_machine_id            = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Compute/virtualMachines/cs3" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "internal"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.2.4" -> (known after apply)
          ~ public_ip_address_id                               = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/publicIPAddresses/cs2PublicIp1" -> "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/publicIPAddresses/cs3PublicIp1"
            # (3 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>